happenings/app/controllers/calendar_controller.rb

  def show
	  @date = params[:date] ? Date.parse(params[:date]) : Date.today
	  @events_by_date = Event.select("id, title, location, date, time")
---
SELECT id, title, location, time, date FROM "events" GROUP BY date