happenings/app/controllers/events_controller.rb

  def show
    @event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = 1 ORDER BY "events"."id" ASC LIMIT 1