cyoa/myctapp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def save_favorite
    if logged_in?
      route = build_route_from_data(params)
      @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def remove_favorite
    if logged_in?
      route = build_route_from_data(params)
      @user = User.find(session[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def favorite_routes
    if logged_in?
      @user = User.find(session[:user_id])