cyoa/app/controllers/ebooks_controller.rb

  def index
    @ebooks = Ebook.order("lower(title)")
---
SELECT "ebooks".* FROM "ebooks"  ORDER BY "ebooks"."title" ASC

  def create
    @ebook = Ebook.new(ebook_params)

    respond_to do |format|
      if @ebook.save
---
INSERT INTO "ebooks" ("user_id", "title", "description", "version", "url", "language", "publisher", "subject", "rights", "readability", "markdown", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    respond_to do |format|
      if @ebook.update(ebook_params)
---
UPDATE "ebooks" SET "url" = $1, "readability" = $2, "updated_at" = $3 WHERE "ebooks"."id" = $4  [["url", "http://stackoverflow.com/questions/5417209/ruby-module-method-access"], ["readability", "t"], ["updated_at", "2015-07-30 16:01:18.234878"], ["id", 5]]

  def destroy
    @ebook.destroy
---
DELETE FROM "ebooks" WHERE "ebooks"."id" = ?  [["id", 1]]

  def my_books
    @ebooks = current_user.ebooks.order('lower(title)')
---
SELECT "ebooks".* FROM "ebooks" WHERE "ebooks"."user_id" = $1  ORDER BY lower(title)  [["user_id", 1]]

    def set_ebook
      @ebook = Ebook.find(params[:id])
---
SELECT  "ebooks".* FROM "ebooks" WHERE "ebooks"."id" = $1 LIMIT 1  [["id", 1]]