cyoa/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 5]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" DESC LIMIT 1
SELECT "ebooks".* FROM "ebooks" WHERE "ebooks"."user_id" = $1  ORDER BY lower(title)  [["user_id", 1]]
---
  def show
    @user = User.find_by_id(params["id"])
    @ebooks = @user.ebooks.order('lower(title)') if @user